[{"Arrival" : "When Solaire arrived in Lordran, he found himself face to face with a great sun. It inspired him. Here he met the cursed undead. As Solaire was keen on jolly cooperation, he offered his help."}, {"Undead Chapel" : "Journeying through the converging lands, he made his way to the undead chapel, joining with the cursed undead against the great gargoyles, both breathing fire. He slayed one with his lightning spear miracle, while the cursed undead slayed the other."}, {"The Depths" : "Together with the cursed undead, he defeated the Gaping dragon, at the bottom of the Depths."}, {"Anor Londo" : "When next the cursed undead crossed paths with this jubilant knight, he was resting at the campfire in Anor Londo, in its inner castle. When Solaire spotted the undead soul, he quipped, 'You really are fond of chatting with me, aren't you? If I didn't know better, I'd think you had feelings for me! Oh, no, dear me. Pretend you didn't hear that! Hah hah hah!'"}, {"Ornstein and Smough" : "Solaire joined the cursed undead in the epic confrontation of the legendary dragonslayer Ornstein and the Executioner Smough."}, {"Demon Ruins" : "In the depths of the Demon Ruins, Solaire became disheartened, fearing that, this deep into his journey, if there was no sun, perhaps there was no sun at all for him."}, {"Lost Izalith" : "Sitting again warmed by the bonfire, the cursed undead finds the Knight Solaire meloncholy in Lost Izalith, questioning his journey entirely."}, {"Sunlight Maggot" : "Slaughtering the parasitic sunlight maggots, Solaire sat among their destroyed carapace and lamented his task. In the dark, underground, how could the Knight of Sunlight and jolly cooperation ever find his own sun?"}, {"Gwyn" : "There, in the pale, fading light of the kiln of the first flame, Solaire joined the cursed undead in the final battle, against the mightiest of Gods, Gwyn, Lord of Cinder"}, {"Linking the Flame" : "Re-kindling the flame, Solaire sacrificed himself to the fire, linking the flame so that the world would live on. In the end, he found his sun, but it was his bright soul that kept the world alight for ages to come."}]
